# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RuledSurface..::..Create Method
RuledSurface Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Curve, Curve) | Creates a Surface object coincident with the ruled surface joining two bounded generating curves. |
| Create(Curve, XYZ) | Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point. |

# See Also
RuledSurface Class
RuledSurface Members
Autodesk.Revit.DB Namespace